transformation-library/src/test/resources/locationdetails/dsq.response/ramq_pharmacysuccess.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <cais:TrackingId xmlns:cais="http://cais-icp.org/v1">3f9b83b7-5365-44af-96a4-360e509248aa</cais:TrackingId>
    <cais:TransactionId xmlns:cais="http://cais-icp.org/v1">095744be-80cb-4f7a-8470-96f232749fc1</cais:TransactionId>
    <cais:SessionID xmlns:cais="http://cais-icp.org/v1">afce5e08bf4342db993e4e7b7fa9f</cais:SessionID>
  </s:Header>
  <s:Body>
    <PRLO_IN202013CAQC_V01 ITSVersion="XML_1.0" xmlns="urn:hl7-org:v3"
                           xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      <id root="b56aba1c-62cf-48b7-a045-5b3f0aa3232a"/>
      <creationTime value="20211221174531"/>
      <responseModeCode code="I"/>
      <versionCode code="NE2006"/>
      <interactionId root="2.16.124.10.101.1.60.3.18" extension="PRLO_IN202013CAQC_V01" displayable="true"/>
      <processingCode code="phms"/>
      <processingModeCode code="T"/>
      <acceptAckCode code="AL"/>
      <receiver typeCode="RCV">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id root="senderRoot" extension="senderApplicationId" displayable="true" use="BUS"/>
          <asAgent xsi:nil="true"/>
          <asLocatedEntity xsi:nil="true"/>
        </device>
      </receiver>
      <respondTo xsi:nil="true"/>
      <sender typeCode="SND">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id root="2.16.124.10.101.1.60.2.11" extension="ODS" displayable="true" use="BUS"/>
          <name>Registre ODS/LDS</name>
          <asAgent xsi:nil="true"/>
          <asLocatedEntity xsi:nil="true"/>
        </device>
      </sender>
      <acknowledgement>
        <typeCode code="AA"/>
        <targetMessage>
          <id root="db1940c3-887a-4935-a4ec-a8cf8c0f7b71"/>
        </targetMessage>
      </acknowledgement>
      <controlActEvent classCode="CACT" moodCode="EVN">
        <id root="eventRoot" extension="eventCorrelationId" displayable="true" use="BUS"/>
        <code code="PRLO_TE202013CA"/>
        <statusCode code="completed"/>
        <subject typeCode="SUBJ" contextControlCode="ON" contextConductionInd="true">
          <registrationRequest classCode="REG" moodCode="RQO">
            <statusCode code="active"/>
            <subject typeCode="SBJ" contextControlCode="AN">
              <serviceDeliveryLocation classCode="SDLOC">
                <id root="2.16.840.1.113883.4.273" extension="1000002848" displayable="true"/>
                <code code="PHARM"/>
                <name>JEAN COUTU PHARMACIE MARC POTVIN</name>
                <addr use="PHYS">
                  <streetAddressLine partType="SAL">6605 BOUL DE LA RIVE-SUD S</streetAddressLine>
                  <additionalLocator partType="ADL">LEVIS, QC</additionalLocator>
                  <city partType="CTY">LEVIS</city>
                  <postalCode partType="ZIP">G6V9H5</postalCode>
                </addr>
                <statusCode code="NI"/>
                <location classCode="PLC" determinerCode="INSTANCE">
                  <code code="BLDG"/>
                  <mobileInd value="false"/>
                  <asIdentifiedLocation classCode="IDENT">
                    <id extension="255919" displayable="true"/>
                    <assigningIdentifierOrganization classCode="ORG" determinerCode="INSTANCE">
                      <name>RAMQ</name>
                    </assigningIdentifierOrganization>
                  </asIdentifiedLocation>
                </location>
                <serviceProviderOrganization classCode="ORG" determinerCode="INSTANCE">
                  <id root="2.16.840.1.113883.4.274" extension="6000001004" displayable="true"/>
                  <name>PHARMACIE MARC POTVIN</name>
                </serviceProviderOrganization>
                <directAuthorityOver xsi:nil="true"/>
                <indirectAuthority typeCode="INDAUTH">
                  <territorialAuthority classCode="TERR">
                    <id root="2.16.124.10.101.1.60.1.10" extension="12" displayable="true"/>
                  </territorialAuthority>
                </indirectAuthority>
                <partOf xsi:nil="true"/>
              </serviceDeliveryLocation>
            </subject>
            <custodian typeCode="CST" contextControlCode="AP">
              <assignedDevice classCode="ASSIGNED">
                <id root="2.16.124.10.101.1.60.2.11" extension="ODS" displayable="true" use="BUS"/>
                <assignedRepository classCode="DEV" determinerCode="INSTANCE">
                  <name>Registre ODS/LDS</name>
                </assignedRepository>
                <representedRepositoryJurisdiction classCode="STATE" determinerCode="INSTANCE">
                  <name>Québec</name>
                </representedRepositoryJurisdiction>
              </assignedDevice>
            </custodian>
          </registrationRequest>
        </subject>
        <queryAck>
          <queryId root="db1940c3-887a-4935-a4ec-a8cf8c0f7b71"/>
          <queryResponseCode code="OK"/>
          <resultTotalQuantity value="1"/>
          <resultCurrentQuantity value="1"/>
          <resultRemainingQuantity value="0"/>
        </queryAck>
        <queryByParameter>
          <queryId root="db1940c3-887a-4935-a4ec-a8cf8c0f7b71"/>
          <parameterList>
            <recordId>
              <value root="2.16.840.1.113883.4.273" extension="1000002848" displayable="true"/>
            </recordId>
          </parameterList>
        </queryByParameter>
      </controlActEvent>
    </PRLO_IN202013CAQC_V01>
  </s:Body>
</s:Envelope>
